app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 31 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 31
---
	def show
		@user = User.find(params[:id])
		@microposts = @user.microposts.paginate(page: params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$10$0F7Dk9vv6rK5IByyLGngheSWyPno6eNl5fF8yqI4qSJzB5tvQfIxO', "remember_token" = 'qMw_MI8S3UbEBwpBkooSEw', "updated_at" = '2013-02-08 05:54:02.087262' WHERE "users"."id" = 1
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes(params[:user])